Revit 2026 API

# StructuralBehavior Enumeration

---

Specifies whether structural elements behave orthotropically, isotropically, or transverse-isotropically.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StructuralBehavior
```
```vb
Public Enumeration StructuralBehavior
```
```cpp
public enum class StructuralBehavior
```
```fsharp
type StructuralBehavior
```

| Member name | Value | Description |
| --- | --- | --- |
| Isotropic | 0 | The structural element behaves isotropically. |
| Orthotropic | 1 | The structural element behaves orthotropically. |
| TransverseIsotropic | 2 | The structural element behaves transverse-isotropically. |

#### Reference

Autodesk.Revit.DB Namespace